nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
# [from, repeats, module, args]
- [-1, 1, Conv,  [64, 3, 2]]           # 0：初始下采样卷积，输出 P1（320x320）特征
- [-1, 1, Conv,  [128, 3, 2, 1, 2]]    # 1：使用空洞卷积进行下采样，输出 P2（160x160）特征
- [-1, 2, DSC3k2,  [256, False, 0.25]] # 2：浅层特征增强模块（DSC3k2），提取局部细节
- [-1, 1, Conv,  [256, 3, 2, 1, 4]]    # 3：空洞卷积进一步下采样，输出 P3（80x80）
- [-1, 2, DSC3k2,  [512, False, 0.25]] # 4：中层特征增强
- [-1, 1, DSConv,  [512, 3, 2]]        # 5：标准深度卷积进行下采样，输出 P4（40x40）
- [-1, 4, A2C2f, [512, True, 4]]       # 6：C2f型空间上下文聚合模块，用于深层表达
- [-1, 1, DSConv,  [1024, 3, 2]]       # 7：进一步下采样到 P5（20x20）
- [-1, 4, A2C2f, [1024, True, 1]]      # 8：最深层语义提取模块，特征表达能力最强

head:
# HyperACE：语义增强模块
- [[4, 6, 8], 2, HyperACEPlus, [512, 512, 1, 8, True, True, 0.5, 1.0, "both", True, 32, True, None, 3, 3, True]]  
  # 9：# 对齐原版的前10项 , h_topk=32, 硬稀疏, 自动头数, 分3层原型, 局部核3, 启用局部分支

# 向上传播路径起点（对 Y 上采样）
- [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10：Y 上采样一倍，用于后续分发

# 创建分发连接的特征路径
- [9, 1, DownsampleConv, []] # 11：将 Y 降采样对齐分辨率，为分发做准备

# FullPAD：高语义特征 Y → 各个 Backbone 层
- [[6, 9], 1,  FullPADDyn, ["channel", 256, 16, 0.5, True, True, 0.0]]  # 12：Y 分发到 P4（index=6）
- [[4, 10], 1, FullPADDyn, ["channel", 256, 16, 0.5, True, True, 0.0]]  # 13：Y 分发到 P3（index=4）
- [[8, 11], 1, FullPADDyn, ["channel", 256, 16, 0.5, True, True, 0.0]]  # 14：Y 分发到 P5（index=8）

# 向上传播路径继续
- [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15：P5 -> P4 上采样
- [[-1, 12], 1, Concat, [1]]                # 16：与 P4 做融合（来自 FullPAD 的 P4）
- [-1, 2, DSC3k2, [512, True]]              # 17：融合后的特征增强处理
- [[-1, 9], 1, FullPADDyn, ["channel", 256, 16, 0.5, True, True, 0.0]]  # 18：再次分发到原始 Y 输出（或 Neck）

# 继续向上传播
- [17, 1, nn.Upsample, [None, 2, "nearest"]] # 19：P4 -> P3 上采样
- [[-1, 13], 1, Concat, [1]]                # 20：与 FullPAD 分发来的 P3 融合
- [-1, 2, DSC3k2, [256, True]]              # 21：融合特征处理
- [10, 1, Conv, [256, 1, 1]]                # 22：Y 特征通道统一（与 P3 对齐）
- [[21, 22], 1, FullPADDyn, ["channel", 256, 16, 0.5, True, True, 0.0]] # 23：再次融合 FullPAD，输出 P3'

# 从 P3' 向下采样，构建 P4'
- [-1, 1, Conv, [256, 3, 2]]                # 24：P3' → 下采样到 P4 尺寸
- [[-1, 18], 1, Concat, [1]]                # 25：与 P4 分发特征融合
- [-1, 2, DSC3k2, [512, True]]              # 26：融合后的深层增强
- [[-1, 9], 1, FullPADDyn, ["channel", 256, 16, 0.5, True, True, 0.0]]          # 27：再次分发到 Y

# 再次下采样，构建 P5'
- [26, 1, Conv, [512, 3, 2]]                # 28：P4' → 下采样到 P5 尺寸
- [[-1, 14], 1, Concat, [1]]                # 29：与 P5 分发特征融合
- [-1, 2, DSC3k2, [1024,True]]              # 30：最终最深层特征（检测用 P5')
- [[-1, 11], 1, FullPADDyn, ["channel", 256, 16, 0.5, True, True, 0.0]]         # 31：再次分发到 Y

# 检测头输出，融合后的 P3'、P4'、P5' 输入 Detect
- [[23, 27, 31], 1, Detect, [nc]]           # 32：最终检测输出，支持多尺度小目标
