nc: 80    # number of classes

scales:   # compound scaling
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------------------------------------------
# LSNet-S backbone 9 行，对应 3 级特征：P3=4，P4=6，P5=8
# ---------------------------------------------------------------
backbone:
   # [from, repeats, module, args] -----------------------------  (←  stride)
  - [-1, 1, Conv,                [128, 3, 2]]                   # 0  P1/2
  - [-1, 1, Conv,                [256, 3, 2]]                   # 1  P2/4
  - [-1, 1, Conv,                [512, 3, 2]]                  # 2  P3/8
  - [-1, 1, LSBlock,       [128, 16, 4, 4, 80, 0, 0]]    # 3  LS-Stage-0
  - [-1, 1, nn.Identity,   []]                            # 4  ←P3/8  (128c)
  - [-1, 1, DSConv,            [512, 3, 2]]              # 5  P4/16  DW-down
  - [-1, 2, LSBlock,       [128, 16, 4, 4, 40, 1, 0]]    # 6  LS-Stage-1
  - [-1, 1, DSConv,              [1024, 3, 2]]            # 7  P5/32  DW-down
  - [-1, 3, LSBlock,       [256, 16, 4, 4, 10, 2, 0]]    # 8  LS-Stage-2
# yolov13-lsnet-test
  # 若真需要 P6/64：再加 [-1,1,DSConv,[448,3,2]] + [-1,10,LSBlock,[448]]

# ---------------------------------------------------------------
# 下面是 Head，必须把**通道数**和**索引**同步
# ---------------------------------------------------------------
head:
  # HyperACE —— 把 (P3,P4,P5) = (4,6,8) 送进来，
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [ 9, 1, DownsampleConv, []]                 # 9 = HyperACE 输出
  - [[6, 9], 1, FullPAD_Tunnel, []]             # 12  (索引不变)
  - [[4, 10], 1, FullPAD_Tunnel, []]            # 13
  - [[8, 11], 1, FullPAD_Tunnel, []]            # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]                # 17  <-- 512 → 320
  - [[-1, 9], 1, FullPAD_Tunnel, []]

  - [17, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [256, True]]                # 21  <-- 256 → 160
  - [10, 1, Conv, [256, 1, 1]]                  # 22  <-- 256 → 160
  - [[21, 22], 1, FullPAD_Tunnel, []]

  - [-1, 1, Conv, [256, 3, 2]]                  # 24  <-- 256 → 160
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]                # 26  <-- 512 → 320
  - [[-1, 9], 1, FullPAD_Tunnel, []]

  - [26, 1, Conv, [512, 3, 2]]                  # 28  <-- 512 → 320
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [1024, True]]                # 30  <-- 1024 → 320
  - [[-1, 11], 1, FullPAD_Tunnel, []]

  - [[23, 27, 31], 1, Detect, [nc]]             # Detect 3 head

