nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]                 # 1、输入原图，3×3卷积步幅2，下采样至P1/2(H/2)，输出64通道，用于初步特征提取
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]          # 2、3×3卷积步幅2，下采样至P2/4(H/4)，输出128通道，padding=1，dilation=2扩大感受野
  - [-1, 2, DSC3K2_MSLA,  [256, False, 0.25]]   # 3、两层轻量深度可分卷积C2f模块，输出256通道，dsc3k=False走DSBottleneck分支，瓶颈扩展比0.25
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]]          # 4、3×3卷积步幅2，下采样至P3/8(H/8)，输出256通道，padding=1，dilation=4进一步扩大感受野
  - [-1, 2, DSC3K2_MSLA,  [512, False, 0.25]]   # 5、两层轻量C2f模块，输出512通道，保持dsc3k=False，扩展比0.25
  - [-1, 1, DSConv,  [512, 3, 2]]              # 6、深度可分卷积，步幅2，下采样至P4/16(H/16)，输出512通道，降低计算量
  - [-1, 4, A2C2f, [512, True, 4]]             # 7、四层A2C2f模块，融合通道注意力与多尺度卷积，输出512通道，开启shortcut，组数4
  - [-1, 1, DSConv,  [1024, 3, 2]]             # 8、深度可分卷积，步幅2，下采样至P5/32(H/32)，输出1024通道
  - [-1, 4, A2C2f, [1024, True, 1]]            # 9、四层A2C2f模块，融合全局语义与多尺度信息，输出1024通道，开启shortcut，组数1

head:
  - [[4, 6, 8], 2, HyperACE_Wavelet, [512, 8, True, True, 0.5, 1, "both"]]  # 三尺度特征(P3=4,P4=6,P5=8)对齐到P4并融合，8个超边的高阶C3AH分支+轻量低阶分支并行增强，输出P4(512c,H/16)
  - [-1, 1, DySample, [2, 'lp', 4, False]]                      # P4特征上采样2倍到P3尺度(H/8)，保持512通道    nn.Upsample,[None, 2, "nearest"]
  - [9, 1, DownsampleConv, []]                                      # P4特征下采样到P5尺度(H/32)，并默认通道翻倍至1024以对齐更深层
  - [[6, 9], 1, FullPAD_Tunnel, []]                                 # 原始P4(6)与融合P4(9)门控残差融合，稳态引入增强信息
  - [[4, 10], 1, FullPAD_Tunnel, []]                                # 原始P3(4)与上采样融合P4(10)门控融合，增强浅层特征
  - [[8, 11], 1, FullPAD_Tunnel, []]                                # 原始P5(8)与下采样融合P4(11)门控融合，增强深层特征
  
  - [-1, 1, DySample, [2, 'lp', 4, False]]                      # 增强P5特征上采样到P4尺度(H/16)
  - [[-1, 12], 1, Concat, [1]]                                      # 上采样P5与增强P4(12)在通道维拼接，得到1536c的P4融合特征
  - [-1, 2, DSC3K2_MSLA, [512, True]]                                    # P4融合特征经两层轻量深度可分卷积模块精炼，压缩至512通道
  - [[-1, 9], 1, FullPAD_Tunnel, []]                                # 精炼P4与初始融合P4(9)门控融合，增强稳定性

  - [17, 1, DySample, [2, 'lp', 4, False]]                      # P4特征上采样到P3尺度(H/8)
  - [[-1, 13], 1, Concat, [1]]                                      # 上采样P4与增强P3(13)拼接，得到1024c的P3融合特征
  - [-1, 2, DSC3K2_MSLA, [256, True]]                                    # P3融合特征精炼，输出256通道
  - [10, 1, Conv, [256, 1, 1]]                                      # 将来自P3增强流(10)的512c用1×1卷积降到256c
  - [[21, 22], 1, FullPAD_Tunnel, []]                               # P3精炼特征与降维特征门控融合，生成最终P3检测特征
  
  - [-1, 1, Conv, [256, 3, 2]]                                      # P3检测特征下采样到P4尺度
  - [[-1, 18], 1, Concat, [1]]                                      # 下采样P3与增强P4(18)拼接
  - [-1, 2, DSC3K2_MSLA, [512, True]]                                    # 融合P4精炼，输出512c
  - [[-1, 9], 1, FullPAD_Tunnel, []]                                # 最终P4检测特征与初始融合P4(9)门控融合

  - [26, 1, Conv, [512, 3, 2]]                                      # P4检测特征下采样到P5尺度
  - [[-1, 14], 1, Concat, [1]]                                      # 下采样P4与增强P5(14)拼接
  - [-1, 2, DSC3K2_MSLA, [1024, True]]                                   # 融合P5精炼，输出1024c
  - [[-1, 11], 1, FullPAD_Tunnel, []]                               # 最终P5检测特征与HyperACE下采样参考(11)门控融合
  
  - [[23, 27, 31], 1, GF2Detect, [nc]]                                 # 多尺度检测头，输入P3(256c,H/8)、P4(512c,H/16)、P5(1024c,H/32)预测类别与回归框

